---
kind: enumMember
id: F:Autodesk.Revit.DB.Visual.WaterType.SwimmingPool
enum: Autodesk.Revit.DB.Visual.WaterType
source: html/e2ec359e-952d-b793-f49c-8dbca2a171d8.htm
---
# Autodesk.Revit.DB.Visual.WaterType.SwimmingPool